In [29]:
import pandas as pd

In [30]:
# import pandas as pd

data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'IT', 'Sales', 'Sales', 'Sales'],
    'Team': ['A', 'B', 'A', 'A', 'B', 'A', 'B', 'B'],
    'Employee': ['Amit', 'Priya', 'Raj', 'Neha', 'Ravi', 'Sonia', 'Vikram', 'Anil'],
    'Salary': [50000, 52000, 60000, 58000, 62000, 45000, 47000, 48000],
    'Experience': [3, 4, 5, 6, 7, 2, 3, 4]
}

df = pd.DataFrame(data)
print(df)

  Department Team Employee  Salary  Experience
0         HR    A     Amit   50000           3
1         HR    B    Priya   52000           4
2         IT    A      Raj   60000           5
3         IT    A     Neha   58000           6
4         IT    B     Ravi   62000           7
5      Sales    A    Sonia   45000           2
6      Sales    B   Vikram   47000           3
7      Sales    B     Anil   48000           4

In [32]:
df.groupby(['Department','Team'])[['Salary','Experience']].mean().round().sort_values(by = 'Salary',ascending = True)

                  Salary  Experience
Department Team
Sales      A     45000.0         2.0
           B     47500.0         4.0
HR         A     50000.0         3.0
           B     52000.0         4.0
IT         A     59000.0         6.0
           B     62000.0         7.0

In [33]:
df.groupby('Department').agg(
                    min_salary = ('Salary','min'),
                    mix_salary = ('Salary','max'),
                    avg_experience = ('Experience','mean')
)

            min_salary  mix_salary  avg_experience
Department
HR               50000       52000             3.5
IT               58000       62000             6.0
Sales            45000       48000             3.0

In [34]:
df.groupby('Department').filter(lambda y: y['Salary'].mean() > 55000)

  Department Team Employee  Salary  Experience
2         IT    A      Raj   60000           5
3         IT    A     Neha   58000           6
4         IT    B     Ravi   62000           7

In [35]:
df.groupby('Department').filter(lambda y: y['Salary'].mean() > 55000)['Department']

2    IT
3    IT
4    IT
Name: Department, dtype: object

In [36]:
df['Salary_Rank'] = df.groupby('Department')['Salary'] .transform(lambda x: x.rank(ascending=False))

In [37]:
df

  Department Team Employee  Salary  Experience  Salary_Rank
0         HR    A     Amit   50000           3          2.0
1         HR    B    Priya   52000           4          1.0
2         IT    A      Raj   60000           5          2.0
3         IT    A     Neha   58000           6          3.0
4         IT    B     Ravi   62000           7          1.0
5      Sales    A    Sonia   45000           2          3.0
6      Sales    B   Vikram   47000           3          2.0
7      Sales    B     Anil   48000           4          1.0

In [38]:
df.sort_values(['Department', 'Salary_Rank'])

  Department Team Employee  Salary  Experience  Salary_Rank
1         HR    B    Priya   52000           4          1.0
0         HR    A     Amit   50000           3          2.0
4         IT    B     Ravi   62000           7          1.0
2         IT    A      Raj   60000           5          2.0
3         IT    A     Neha   58000           6          3.0
7      Sales    B     Anil   48000           4          1.0
6      Sales    B   Vikram   47000           3          2.0
5      Sales    A    Sonia   45000           2          3.0

In [39]:
df.pivot_table(
    index='Department',
    values=['Salary','Experience'],
    aggfunc=(['sum','mean'])
)

                  sum               mean
           Experience  Salary Experience        Salary
Department
HR                  7  102000        3.5  51000.000000
IT                 18  180000        6.0  60000.000000
Sales               9  140000        3.0  46666.666667

In [40]:
pivot_df = df.pivot_table(
    index='Department',
    values=['Salary','Experience'],
    aggfunc={'Salary':'sum', 'Experience':'mean'}
).rename(columns={'Salary':'Total_Salary','Experience':'Avg_Experience'})

In [41]:
pivot_df

            Avg_Experience  Total_Salary
Department
HR                     3.5        102000
IT                     6.0        180000
Sales                  3.0        140000

In [42]:
df

  Department Team Employee  Salary  Experience  Salary_Rank
0         HR    A     Amit   50000           3          2.0
1         HR    B    Priya   52000           4          1.0
2         IT    A      Raj   60000           5          2.0
3         IT    A     Neha   58000           6          3.0
4         IT    B     Ravi   62000           7          1.0
5      Sales    A    Sonia   45000           2          3.0
6      Sales    B   Vikram   47000           3          2.0
7      Sales    B     Anil   48000           4          1.0

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Department   8 non-null      object
 1   Team         8 non-null      object
 2   Employee     8 non-null      object
 3   Salary       8 non-null      int64
 4   Experience   8 non-null      int64
 5   Salary_Rank  8 non-null      float64
dtypes: float64(1), int64(2), object(3)
memory usage: 516.0+ bytes

In [44]:
df.describe()

            Salary  Experience  Salary_Rank
count      8.00000    8.000000     8.000000
mean   52750.00000    4.250000     1.875000
std     6430.95194    1.669046     0.834523
min    45000.00000    2.000000     1.000000
25%    47750.00000    3.000000     1.000000
50%    51000.00000    4.000000     2.000000
75%    58500.00000    5.250000     2.250000
max    62000.00000    7.000000     3.000000

In [45]:
df.duplicated().sum()

np.int64(0)

In [46]:
df

  Department Team Employee  Salary  Experience  Salary_Rank
0         HR    A     Amit   50000           3          2.0
1         HR    B    Priya   52000           4          1.0
2         IT    A      Raj   60000           5          2.0
3         IT    A     Neha   58000           6          3.0
4         IT    B     Ravi   62000           7          1.0
5      Sales    A    Sonia   45000           2          3.0
6      Sales    B   Vikram   47000           3          2.0
7      Sales    B     Anil   48000           4          1.0

In [47]:
df[(df['Team'] =='A') & (df['Salary_Rank'] == 2)]

  Department Team Employee  Salary  Experience  Salary_Rank
0         HR    A     Amit   50000           3          2.0
2         IT    A      Raj   60000           5          2.0

In [48]:
df['experiance_rank'] = df.groupby(['Department'])['Experience'].transform(lambda y : y.rank(ascending=True))

In [49]:
df

  Department Team Employee  Salary  Experience  Salary_Rank  experiance_rank
0         HR    A     Amit   50000           3          2.0              1.0
1         HR    B    Priya   52000           4          1.0              2.0
2         IT    A      Raj   60000           5          2.0              1.0
3         IT    A     Neha   58000           6          3.0              2.0
4         IT    B     Ravi   62000           7          1.0              3.0
5      Sales    A    Sonia   45000           2          3.0              1.0
6      Sales    B   Vikram   47000           3          2.0              2.0
7      Sales    B     Anil   48000           4          1.0              3.0